import { Typography , Box } from "@mui/material"

function About(){

    return (
        <Box>
            <Typography >
                העסק שלנו מתמחה במתן פתרונות דיגיטליים מתקדמים לניהול מערכות קופונים, משתמשים ודוחות. אנו מספקים פלטפורמה ידידותית למשתמש שמאפשרת לעסקים לייעל את ניהול ההנחות והקמפיינים השיווקיים שלהם, לנתח את השימוש בקופונים בזמן אמת ולשפר את חוויית הלקוח. עם דגש על אבטחת מידע, קלות שימוש ויכולות התאמה אישית, הפתרונות שלנו מסייעים לעסקים למקסם את הערך השיווקי שלהם תוך שמירה על תפעול חלק ואפקטיבי.
            </Typography>
        </Box>
    )
}

export default About;